# panda

In [1]:
#what is panda?
'''
Panda is open source library.
Simple yet powerfull and expressive tool.
Use for data manupulation and analysis.
'''

# where did the name pandas come from?
'''
The name pandas drived from panel data.
Panel data is multidimensional data involving measurements over time.
It consists various attributes with differnt attribute values.
'''

#Who created panda?
'''
Created in 2015.
Was created by American software developer and a business man named Wes McKinney.
'''

#Features of pandas
'''
1.Series object and data frames(1D and 2D)
2.Handling of missing data(NAN)
3.Data Alignent(Expclicitly aligned)
4.Group by functionality(Split Uplike and combine operations on data for both aggregating and tranformatting the data)
5.Slicing , Indexing and Subseting
6.Merging and joining
7.Reshaping
8.Hierarchical labelling of axes
9.Robust input outpt tool(flat files CSB and eliminate files from FLAC files like CSB or Excel files database or loading data from ultrafast SDF flateful Mac)
10.Time series specific functinality(Data range generation frequency conversion moving window statics moving linear regression data sifting logging exit)
'''

#What kind of data does suits Pandas the most?
'''
1.Tabular data 
2.Time series data -Ordered and unordered time series data
3.Arbitrary matrix CDO 
'''

# Pandas Vs Numpy
# Pandas
'''
1.Pnadas perform better than numpy for 500k rows or more.
2.Pandas series objects is more flexible as you can define your own labeled index to index and access elements of an array.


'''
# Numpy
'''
1.Numpy performs better for 50k rows or less.
2.Elements in Numpy are accessed by their deafult integer position.
'''

#Pandas : Series Objects
#Dataset in Pnadas

# 1.One Dimensional 
'''
Known as Series Objects
'''

# 2.Multi Dimensional
'''
Data Frame - 2 Dimensional
Panel data - 3 Dimensional

'''

#Series Object
'''
* One Dimensional labeled array
* Contains data of similar or mixed types
'''

# Create different Series Object data types 

'''
pandas is not just about list . You can use diffeernt arrays ,dictionary or can use any scalar and cosntantvalue to create series objects
'''

# What is dataframe? 2D
'''
Two dimensional labeled data structures with column of potentially differnt types
'''

# Fetures of data frames
'''
1. Contains column of differnt types
2. Mutable size
3. Labels Axes
4. Arithmetic operations on rows and column
'''

'\n1.Numpy performs better for 50k rows or less.\n2.Elements in Numpy are accessed by their deafult integer position.\n'

# Series Objects in pandas

In [2]:
#Importing Pandas 
import pandas as pd

In [4]:
data = [1,2,3,4]
series1 = pd.Series(data)

In [5]:
series1

0    1
1    2
2    3
3    4
dtype: int64

# How to check the type?

In [6]:
# whether it is series objects or not
type(series1)

pandas.core.series.Series

# How to change the index name?

In [10]:
# 0 1 2 3 to a b c d
series1 = pd.Series(data, index=['a','b','c','d'])

In [11]:
series1

a    1
b    2
c    3
d    4
dtype: int64

# DataFrame
# How to create a datframe ?

In [12]:
#Creatong a data frame using list
da = [1,2,3,4,5]
df = pd.DataFrame(da)
df

   0
0  1
1  2
2  3
3  4
4  5

In [13]:
#Creating a dataframe using a dictionay
dic = {'fruits':['apple','banana','mango','pineapple'],'vegetables':['potato','onion','chilli','ginger']}
df2 = pd.DataFrame(dic)
df2

      fruits vegetables
0      apple     potato
1     banana      onion
2      mango     chilli
3  pineapple     ginger

In [15]:
#Creating a dataframe by series
ser = pd.Series([1,2],index=['a','b'])
ser

a    1
b    2
dtype: int64

In [17]:
df3 = pd.DataFrame(ser)
df3

   0
a  1
b  2

In [19]:
#Creating dataframe by numpy array

import numpy as np
numpyarr = np.array([[5000,6000],['John','James']])
df = pd.DataFrame({'name':numpyarr[1],'salary':numpyarr[0]})
df

    name salary
0   John   5000
1  James   6000

# Merge , Join and Concatenate

# How to perform merge operations ?

In [21]:
player = ['Player1','Player2','Player3']
points = [4,2,3]
title = ['Game1','Game2','Game3']
df1 = pd.DataFrame({'Player':player,'Points':points,'Title':title})
df1

    Player  Points  Title
0  Player1       4  Game1
1  Player2       2  Game2
2  Player3       3  Game3

In [24]:
player = ['Player1','Player5','Player6']
power = ['Punch','Kick','Elbow']
title = ['Game1','Game5','Game6']
df2 = pd.DataFrame({'Player':player,'Power':power,'Title':title})
df2

    Player  Power  Title
0  Player1  Punch  Game1
1  Player5   Kick  Game5
2  Player6  Elbow  Game6

# Inner Merge

In [25]:
#Inner Merge - Return the data which is common in both the dataframe on the basis of key value
df1.merge(df2 , on='Title' , how='inner')   #On the basis of title and how - by inner merge

  Player_x  Points  Title Player_y  Power
0  Player1       4  Game1  Player1  Punch

In [26]:
#By deafult inner merge
df1.merge(df2 , on='Player' , how='inner')

    Player  Points Title_x  Power Title_y
0  Player1       4   Game1  Punch   Game1

# Left Merge

In [27]:
df1.merge(df2 , on='Player' , how='left')

    Player  Points Title_x  Power Title_y
0  Player1       4   Game1  Punch   Game1
1  Player2       2   Game2    NaN     NaN
2  Player3       3   Game3    NaN     NaN

# Right Merge

In [28]:
df1.merge(df2 , on='Player' , how='right')

    Player  Points Title_x  Power Title_y
0  Player1     4.0   Game1  Punch   Game1
1  Player5     NaN     NaN   Kick   Game5
2  Player6     NaN     NaN  Elbow   Game6

# Outer Merge

In [29]:
df1.merge(df2 , on='Player' , how='outer')

    Player  Points Title_x  Power Title_y
0  Player1     4.0   Game1  Punch   Game1
1  Player2     2.0   Game2    NaN     NaN
2  Player3     3.0   Game3    NaN     NaN
3  Player5     NaN     NaN   Kick   Game5
4  Player6     NaN     NaN  Elbow   Game6

# How to perform Joint Operations ?

In [30]:
#In panda merges operation is done by attributes name and column name - Atleast 1 common attribute to merge
#In pandas joint operation is done by index value  - Join is used when 2 tables have completely differnt attributes
#That why we have to specify index for join

In [45]:
player = ['Player1','Player2','Player3']
points = [4,2,3]
title = ['Game1','Game2','Game3']
df3 = pd.DataFrame({'Players':player,'Points':points,'Titles':title},index=['L1','L2','L3'])
df3

    Players  Points Titles
L1  Player1       4  Game1
L2  Player2       2  Game2
L3  Player3       3  Game3

In [46]:
player = ['Player1','Player5','Player6']
power = ['Punch','Kick','Elbow']
title = ['Game1','Game5','Game6']
df4 = pd.DataFrame({'Player':player,'Power':power,'Title':title},index=['L2','L3','L4'])
df4

     Player  Power  Title
L2  Player1  Punch  Game1
L3  Player5   Kick  Game5
L4  Player6  Elbow  Game6

# Inner join

In [49]:
#2 dataframe are joins by index name or value
df3.join(df4, how='inner') #Same index

    Players  Points Titles   Player  Power  Title
L2  Player2       2  Game2  Player1  Punch  Game1
L3  Player3       3  Game3  Player5   Kick  Game5

# Left Join

In [50]:
df3.join(df4, how='left')

    Players  Points Titles   Player  Power  Title
L1  Player1       4  Game1      NaN    NaN    NaN
L2  Player2       2  Game2  Player1  Punch  Game1
L3  Player3       3  Game3  Player5   Kick  Game5

# Right Join

In [51]:
df3.join(df4, how='right')

    Players  Points Titles   Player  Power  Title
L2  Player2     2.0  Game2  Player1  Punch  Game1
L3  Player3     3.0  Game3  Player5   Kick  Game5
L4      NaN     NaN    NaN  Player6  Elbow  Game6

# Outer Join

In [52]:
df3.join(df4, how='outer')

    Players  Points Titles   Player  Power  Title
L1  Player1     4.0  Game1      NaN    NaN    NaN
L2  Player2     2.0  Game2  Player1  Punch  Game1
L3  Player3     3.0  Game3  Player5   Kick  Game5
L4      NaN     NaN    NaN  Player6  Elbow  Game6

# how to concatenate 2 dataFrame ?

In [53]:
pd.concat([df3,df4])

/home/ansari/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

     Player  Players  Points  Power  Title Titles
L1      NaN  Player1     4.0    NaN    NaN  Game1
L2      NaN  Player2     2.0    NaN    NaN  Game2
L3      NaN  Player3     3.0    NaN    NaN  Game3
L2  Player1      NaN     NaN  Punch  Game1    NaN
L3  Player5      NaN     NaN   Kick  Game5    NaN
L4  Player6      NaN     NaN  Elbow  Game6    NaN

# Importing and analyzing dataset

In [1]:
import pandas as pd

In [ ]:
#Reading datasets from csv file
cars = pd.reaad_csv('xyx.csv')
cars

In [ ]:
#Check the type
type(cars)

In [ ]:
#View only first 5 records
cars.heaad()

In [ ]:
#View 10 Records
cars.head(10)

In [ ]:
#View only Last 5 records
cars.tail()

In [ ]:
#View only Last 10 records
cars.tail(10)

In [ ]:
#View no of rows and columns in the dataframes
cars.shape

In [ ]:
#Print a consie summary of the columns
cars.info(null_counts=True) #How many non null values are present

In [ ]:
#mean or datframe.mean
cars.mean()

In [ ]:
#medain
cars.median()

In [ ]:
#STd - standard ddeviation
cars.std()

In [ ]:
#Maximum value
cars.max()

In [ ]:
#Minimum value
cars.min()

In [ ]:
#Number of non null in eeach column
cars.count()

In [ ]:
#descriptive statistics summary
cars.describe()  # mean , median , std etcetc

# What is data cleaning

In [ ]:
#Data cleaning or data cleansing is the process of detecting , correcting or removing corrupt or inaccurate records from a data set , table or database.
#It also refers to idetifying incomplete,incorrect or irrelevant parts of the data and then replacing ,modifying or deleting the dirty data.

In [ ]:
#Rename column
cars= cars.rename(columns= {'Unnamed: 1':'model1'})
cars

In [ ]:
#Fill the null values with the mean of the column
cars.qsec = cars.qsec.fillna(cars.qsec.mean()) #qsec = column name
cars

In [ ]:
#Drop the unwanted column
cars = cars.drop(columns=['S.No'])
cars

In [ ]:
#find correlation matrix   , coreelation not found between sring data type
df = cars[['mpg','cyl','disp','hp']].corr()
df

In [ ]:
#chnaging the data type
cars.mpg = cars.mpg.astype(float) #from string to float
#see the changes
cars.info(null_counts=True)

# Manupulating dataset

# How to perform indexing on dataset?


# Indexing by position

In [ ]:
# View hp column which is on position 4
cars.iloc[:,4]

In [ ]:
# View hp column first 5 record ,which is on position 4
cars.iloc[:5,4]

In [ ]:
# view all the column and all the rows
cars.iloc[:,:]

In [ ]:
#Indexing by label
cars.iloc[:,'mpg'] # mpg = column name

In [ ]:
#see the frist 7 record from mpg to qsec records
cars.iloc[:6,'mpg':'qsec']

# How to set value for a column ?

# Setting value

In [ ]:
#set value 1 to column 'am'
cars['am'] = 1
cars

# How to manipulate data using lambda function ?
# Applying Functions

In [ ]:
#double up records in 'am' using lambda function
f= lambda x : x*2
cars['am'] = cars['am'].apply(f)
cars

# How to sort a column ?
# Sorting

In [ ]:
#sorting cyl column in ascending value
cars.sort_values(by='cyl')
cars

In [ ]:
#sorting cyl column in descending value
cars.sort_values(by='cyl', ascending = False)

# How to filter your records ?
# Filtering

In [ ]:
#filtering records with more than 6 cylinders
cars['cyl'] > 6  # Give True false value

In [ ]:
filters = cars['cyl'] > 6
#apply filetr to dataframe
filter_new = cars[filters]
filter_new

In [ ]:
filters = (cars['cyl'] > 6)  & (cars['hp']>300)
#apply filetr to dataframe
filter_new = cars[filters]
filter_new